
bomb:     file format elf64-x86-64

Contents of the .eh_frame section (loaded from bomb):


00000000 0000000000000014 00000000 CIE
  Version:               1
  Augmentation:          "zR"
  Code alignment factor: 1
  Data alignment factor: -8
  Return address column: 16
  Augmentation data:     1b
  DW_CFA_def_cfa: r7 (rsp) ofs 8
  DW_CFA_offset: r16 (rip) at cfa-8
  DW_CFA_nop
  DW_CFA_nop

00000018 0000000000000014 0000001c FDE cie=00000000 pc=00000000000013a0..00000000000013c6
  DW_CFA_advance_loc: 4 to 00000000000013a4
  DW_CFA_undefined: r16 (rip)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000030 0000000000000024 00000034 FDE cie=00000000 pc=0000000000001020..00000000000011e0
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 6 to 0000000000001026
  DW_CFA_def_cfa_offset: 24
  DW_CFA_advance_loc: 10 to 0000000000001030
  DW_CFA_def_cfa_expression (DW_OP_breg7 (rsp): 8; DW_OP_breg16 (rip): 0; DW_OP_lit15; DW_OP_and; DW_OP_lit10; DW_OP_ge; DW_OP_lit3; DW_OP_shl; DW_OP_plus)
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000058 0000000000000014 0000005c FDE cie=00000000 pc=00000000000011e0..00000000000011f0
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

00000070 0000000000000014 00000074 FDE cie=00000000 pc=00000000000011f0..00000000000013a0
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop


0000045c 0000000000000030 00000460 FDE cie=00000000 pc=00000000000028db..0000000000002ad0
  DW_CFA_advance_loc: 6 to 00000000000028e1
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r12 (r12) at cfa-16
  DW_CFA_advance_loc: 1 to 00000000000028e2
  DW_CFA_def_cfa_offset: 24
  DW_CFA_offset: r6 (rbp) at cfa-24
  DW_CFA_advance_loc: 1 to 00000000000028e3
  DW_CFA_def_cfa_offset: 32
  DW_CFA_offset: r3 (rbx) at cfa-32
  DW_CFA_advance_loc: 4 to 00000000000028e7
  DW_CFA_def_cfa_offset: 64
  DW_CFA_advance_loc1: 243 to 00000000000029da
  DW_CFA_remember_state
  DW_CFA_def_cfa_offset: 32
  DW_CFA_advance_loc: 1 to 00000000000029db
  DW_CFA_def_cfa_offset: 24
  DW_CFA_advance_loc: 1 to 00000000000029dc
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 2 to 00000000000029de
  DW_CFA_def_cfa_offset: 8
  DW_CFA_advance_loc: 1 to 00000000000029df
  DW_CFA_restore_state
  DW_CFA_nop

00000490 0000000000000024 00000494 FDE cie=00000000 pc=0000000000002ad0..0000000000002b47
  DW_CFA_advance_loc: 5 to 0000000000002ad5
  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r3 (rbx) at cfa-16
  DW_CFA_advance_loc: 29 to 0000000000002af2
  DW_CFA_remember_state
  DW_CFA_def_cfa_offset: 8
  DW_CFA_advance_loc: 1 to 0000000000002af3
  DW_CFA_restore_state
  DW_CFA_advance_loc: 40 to 0000000000002b1b
  DW_CFA_def_cfa_offset: 24
  DW_CFA_advance_loc: 1 to 0000000000002b1c
  DW_CFA_def_cfa_offset: 32
  DW_CFA_advance_loc: 41 to 0000000000002b45
  DW_CFA_def_cfa_offset: 16
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

000004b8 ZERO terminator


Contents of the .debug_aranges section (loaded from bomb):

  Length:                   44
  Version:                  2
  Offset into .debug_info:  0x0
  Pointer Size:             8
  Segment Size:             0

    Address            Length
    0000000000001489 0000000000000122 
    0000000000000000 0000000000000000 

Contents of the .debug_info section (loaded from bomb):

  Compilation Unit @ offset 0x0:
   Length:        0x6db (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  8
 <0><c>: Abbrev Number: 20 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x58): GNU C17 11.4.0 -mtune=generic -march=x86-64 -ggdb -O1 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect line string, offset: 0x2a): bomb.c
    <16>   DW_AT_comp_dir    : (indirect line string, offset: 0x0): /home/ygli/xjtu-ics-2023/lab2/bomblab/src
    <1a>   DW_AT_low_pc      : 0x1489
    <22>   DW_AT_high_pc     : 0x122
    <2a>   DW_AT_stmt_list   : 0x0
 <1><2e>: Abbrev Number: 9 (DW_TAG_typedef)
    <2f>   DW_AT_name        : (indirect string, offset: 0x23): size_t
    <33>   DW_AT_decl_file   : 3
    <34>   DW_AT_decl_line   : 209
    <35>   DW_AT_decl_column : 23
    <36>   DW_AT_type        : <0x3a>
 <1><3a>: Abbrev Number: 4 (DW_TAG_base_type)
    <3b>   DW_AT_byte_size   : 8
    <3c>   DW_AT_encoding    : 7	(unsigned)
    <3d>   DW_AT_name        : (indirect string, offset: 0x46): long unsigned int
 <1><41>: Abbrev Number: 4 (DW_TAG_base_type)
    <42>   DW_AT_byte_size   : 4
    <43>   DW_AT_encoding    : 7	(unsigned)
    <44>   DW_AT_name        : (indirect string, offset: 0x4b): unsigned int
 <1><48>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <49>   DW_AT_byte_size   : 8
 <1><4a>: Abbrev Number: 4 (DW_TAG_base_type)
    <4b>   DW_AT_byte_size   : 1
    <4c>   DW_AT_encoding    : 8	(unsigned char)
    <4d>   DW_AT_name        : (indirect string, offset: 0x224): unsigned char
 <1><51>: Abbrev Number: 4 (DW_TAG_base_type)
    <52>   DW_AT_byte_size   : 2
    <53>   DW_AT_encoding    : 7	(unsigned)
    <54>   DW_AT_name        : (indirect string, offset: 0x1af): short unsigned int
 <1><58>: Abbrev Number: 4 (DW_TAG_base_type)
    <59>   DW_AT_byte_size   : 1
    <5a>   DW_AT_encoding    : 6	(signed char)
    <5b>   DW_AT_name        : (indirect string, offset: 0x226): signed char
 <1><5f>: Abbrev Number: 4 (DW_TAG_base_type)
    <60>   DW_AT_byte_size   : 2
    <61>   DW_AT_encoding    : 5	(signed)
    <62>   DW_AT_name        : (indirect string, offset: 0x232): short int
 <1><66>: Abbrev Number: 22 (DW_TAG_base_type)
    <67>   DW_AT_byte_size   : 4
    <68>   DW_AT_encoding    : 5	(signed)
    <69>   DW_AT_name        : int
 <1><6d>: Abbrev Number: 4 (DW_TAG_base_type)
    <6e>   DW_AT_byte_size   : 8
    <6f>   DW_AT_encoding    : 5	(signed)
    <70>   DW_AT_name        : (indirect string, offset: 0xfc): long int
 <1><74>: Abbrev Number: 9 (DW_TAG_typedef)
    <75>   DW_AT_name        : (indirect string, offset: 0x7): __off_t
    <79>   DW_AT_decl_file   : 4
    <7a>   DW_AT_decl_line   : 152
    <7b>   DW_AT_decl_column : 25
    <7c>   DW_AT_type        : <0x6d>
 <1><80>: Abbrev Number: 9 (DW_TAG_typedef)
    <81>   DW_AT_name        : (indirect string, offset: 0x264): __off64_t
    <85>   DW_AT_decl_file   : 4
    <86>   DW_AT_decl_line   : 153
    <87>   DW_AT_decl_column : 27
    <88>   DW_AT_type        : <0x6d>
 <1><8c>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <8d>   DW_AT_byte_size   : 8
    <8d>   DW_AT_type        : <0x91>
 <1><91>: Abbrev Number: 4 (DW_TAG_base_type)
    <92>   DW_AT_byte_size   : 1
    <93>   DW_AT_encoding    : 6	(signed char)
    <94>   DW_AT_name        : (indirect string, offset: 0x22d): char
 <1><98>: Abbrev Number: 23 (DW_TAG_const_type)
    <99>   DW_AT_type        : <0x91>
 <1><9d>: Abbrev Number: 24 (DW_TAG_structure_type)
    <9e>   DW_AT_name        : (indirect string, offset: 0x20c): _IO_FILE
    <a2>   DW_AT_byte_size   : 216
    <a3>   DW_AT_decl_file   : 5
    <a4>   DW_AT_decl_line   : 49
    <a5>   DW_AT_decl_column : 8
    <a6>   DW_AT_sibling     : <0x207>
 <2><aa>: Abbrev Number: 1 (DW_TAG_member)
    <ab>   DW_AT_name        : (indirect string, offset: 0x128): _flags
    <af>   DW_AT_decl_file   : 5
    <af>   DW_AT_decl_line   : 51
    <b0>   DW_AT_decl_column : 7
    <b1>   DW_AT_type        : <0x66>
    <b5>   DW_AT_data_member_location: 0
 <2><b6>: Abbrev Number: 1 (DW_TAG_member)
    <b7>   DW_AT_name        : (indirect string, offset: 0xf): _IO_read_ptr
    <bb>   DW_AT_decl_file   : 5
    <bb>   DW_AT_decl_line   : 54
    <bc>   DW_AT_decl_column : 9
    <bd>   DW_AT_type        : <0x8c>
    <c1>   DW_AT_data_member_location: 8
 <2><c2>: Abbrev Number: 1 (DW_TAG_member)
    <c3>   DW_AT_name        : (indirect string, offset: 0x11b): _IO_read_end
    <c7>   DW_AT_decl_file   : 5
    <c7>   DW_AT_decl_line   : 55
    <c8>   DW_AT_decl_column : 9
    <c9>   DW_AT_type        : <0x8c>
    <cd>   DW_AT_data_member_location: 16
 <2><ce>: Abbrev Number: 1 (DW_TAG_member)
    <cf>   DW_AT_name        : (indirect string, offset: 0x26e): _IO_read_base
    <d3>   DW_AT_decl_file   : 5
    <d3>   DW_AT_decl_line   : 56
    <d4>   DW_AT_decl_column : 9
    <d5>   DW_AT_type        : <0x8c>
    <d9>   DW_AT_data_member_location: 24
 <2><da>: Abbrev Number: 1 (DW_TAG_member)
    <db>   DW_AT_name        : (indirect string, offset: 0x2fc): _IO_write_base
    <df>   DW_AT_decl_file   : 5
    <df>   DW_AT_decl_line   : 57
    <e0>   DW_AT_decl_column : 9
    <e1>   DW_AT_type        : <0x8c>
    <e5>   DW_AT_data_member_location: 32
 <2><e6>: Abbrev Number: 1 (DW_TAG_member)
    <e7>   DW_AT_name        : (indirect string, offset: 0x1a1): _IO_write_ptr
    <eb>   DW_AT_decl_file   : 5
    <eb>   DW_AT_decl_line   : 58
    <ec>   DW_AT_decl_column : 9
    <ed>   DW_AT_type        : <0x8c>
    <f1>   DW_AT_data_member_location: 40
 <2><f2>: Abbrev Number: 1 (DW_TAG_member)
    <f3>   DW_AT_name        : (indirect string, offset: 0x1f3): _IO_write_end
    <f7>   DW_AT_decl_file   : 5
    <f7>   DW_AT_decl_line   : 59
    <f8>   DW_AT_decl_column : 9
    <f9>   DW_AT_type        : <0x8c>
    <fd>   DW_AT_data_member_location: 48
 <2><fe>: Abbrev Number: 1 (DW_TAG_member)
    <ff>   DW_AT_name        : (indirect string, offset: 0x34): _IO_buf_base
    <103>   DW_AT_decl_file   : 5
    <103>   DW_AT_decl_line   : 60
    <104>   DW_AT_decl_column : 9
    <105>   DW_AT_type        : <0x8c>
    <109>   DW_AT_data_member_location: 56
 <2><10a>: Abbrev Number: 1 (DW_TAG_member)
    <10b>   DW_AT_name        : (indirect string, offset: 0x12f): _IO_buf_end
    <10f>   DW_AT_decl_file   : 5
    <10f>   DW_AT_decl_line   : 61
    <110>   DW_AT_decl_column : 9
    <111>   DW_AT_type        : <0x8c>
    <115>   DW_AT_data_member_location: 64
 <2><116>: Abbrev Number: 1 (DW_TAG_member)
    <117>   DW_AT_name        : (indirect string, offset: 0x1c2): _IO_save_base
    <11b>   DW_AT_decl_file   : 5
    <11b>   DW_AT_decl_line   : 64
    <11c>   DW_AT_decl_column : 9
    <11d>   DW_AT_type        : <0x8c>
    <121>   DW_AT_data_member_location: 72
 <2><122>: Abbrev Number: 1 (DW_TAG_member)
    <123>   DW_AT_name        : (indirect string, offset: 0x2d4): _IO_backup_base
    <127>   DW_AT_decl_file   : 5
    <127>   DW_AT_decl_line   : 65
    <128>   DW_AT_decl_column : 9
    <129>   DW_AT_type        : <0x8c>
    <12d>   DW_AT_data_member_location: 80
 <2><12e>: Abbrev Number: 1 (DW_TAG_member)
    <12f>   DW_AT_name        : (indirect string, offset: 0x27c): _IO_save_end
    <133>   DW_AT_decl_file   : 5
    <133>   DW_AT_decl_line   : 66
    <134>   DW_AT_decl_column : 9
    <135>   DW_AT_type        : <0x8c>
    <139>   DW_AT_data_member_location: 88
 <2><13a>: Abbrev Number: 1 (DW_TAG_member)
    <13b>   DW_AT_name        : (indirect string, offset: 0x21b): _markers
    <13f>   DW_AT_decl_file   : 5
    <13f>   DW_AT_decl_line   : 68
    <140>   DW_AT_decl_column : 22
    <141>   DW_AT_type        : <0x220>
    <145>   DW_AT_data_member_location: 96
 <2><146>: Abbrev Number: 1 (DW_TAG_member)
    <147>   DW_AT_name        : (indirect string, offset: 0x1c): _chain
    <14b>   DW_AT_decl_file   : 5
    <14b>   DW_AT_decl_line   : 70
    <14c>   DW_AT_decl_column : 20
    <14d>   DW_AT_type        : <0x225>
    <151>   DW_AT_data_member_location: 104
 <2><152>: Abbrev Number: 1 (DW_TAG_member)
    <153>   DW_AT_name        : (indirect string, offset: 0x113): _fileno
    <157>   DW_AT_decl_file   : 5
    <157>   DW_AT_decl_line   : 72
    <158>   DW_AT_decl_column : 7
    <159>   DW_AT_type        : <0x66>
    <15d>   DW_AT_data_member_location: 112
 <2><15e>: Abbrev Number: 1 (DW_TAG_member)
    <15f>   DW_AT_name        : (indirect string, offset: 0x1d6): _flags2
    <163>   DW_AT_decl_file   : 5
    <163>   DW_AT_decl_line   : 73
    <164>   DW_AT_decl_column : 7
    <165>   DW_AT_type        : <0x66>
    <169>   DW_AT_data_member_location: 116
 <2><16a>: Abbrev Number: 1 (DW_TAG_member)
    <16b>   DW_AT_name        : (indirect string, offset: 0x160): _old_offset
    <16f>   DW_AT_decl_file   : 5
    <16f>   DW_AT_decl_line   : 74
    <170>   DW_AT_decl_column : 11
    <171>   DW_AT_type        : <0x74>
    <175>   DW_AT_data_member_location: 120
 <2><176>: Abbrev Number: 1 (DW_TAG_member)
    <177>   DW_AT_name        : (indirect string, offset: 0x13b): _cur_column
    <17b>   DW_AT_decl_file   : 5
    <17b>   DW_AT_decl_line   : 77
    <17c>   DW_AT_decl_column : 18
    <17d>   DW_AT_type        : <0x51>
    <181>   DW_AT_data_member_location: 128
 <2><182>: Abbrev Number: 1 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0x24a): _vtable_offset
    <187>   DW_AT_decl_file   : 5
    <187>   DW_AT_decl_line   : 78
    <188>   DW_AT_decl_column : 15
    <189>   DW_AT_type        : <0x58>
    <18d>   DW_AT_data_member_location: 130
 <2><18e>: Abbrev Number: 1 (DW_TAG_member)
    <18f>   DW_AT_name        : (indirect string, offset: 0x2a): _shortbuf
    <193>   DW_AT_decl_file   : 5
    <193>   DW_AT_decl_line   : 79
    <194>   DW_AT_decl_column : 8
    <195>   DW_AT_type        : <0x22a>
    <199>   DW_AT_data_member_location: 131
 <2><19a>: Abbrev Number: 1 (DW_TAG_member)
    <19b>   DW_AT_name        : (indirect string, offset: 0x1d0): _lock
    <19f>   DW_AT_decl_file   : 5
    <19f>   DW_AT_decl_line   : 81
    <1a0>   DW_AT_decl_column : 15
    <1a1>   DW_AT_type        : <0x23a>
    <1a5>   DW_AT_data_member_location: 136
 <2><1a6>: Abbrev Number: 1 (DW_TAG_member)
    <1a7>   DW_AT_name        : (indirect string, offset: 0x164): _offset
    <1ab>   DW_AT_decl_file   : 5
    <1ab>   DW_AT_decl_line   : 89
    <1ac>   DW_AT_decl_column : 13
    <1ad>   DW_AT_type        : <0x80>
    <1b1>   DW_AT_data_member_location: 144
 <2><1b2>: Abbrev Number: 1 (DW_TAG_member)
    <1b3>   DW_AT_name        : (indirect string, offset: 0x14a): _codecvt
    <1b7>   DW_AT_decl_file   : 5
    <1b7>   DW_AT_decl_line   : 91
    <1b8>   DW_AT_decl_column : 23
    <1b9>   DW_AT_type        : <0x244>
    <1bd>   DW_AT_data_member_location: 152
 <2><1be>: Abbrev Number: 1 (DW_TAG_member)
    <1bf>   DW_AT_name        : (indirect string, offset: 0x23f): _wide_data
    <1c3>   DW_AT_decl_file   : 5
    <1c3>   DW_AT_decl_line   : 92
    <1c4>   DW_AT_decl_column : 25
    <1c5>   DW_AT_type        : <0x24e>
    <1c9>   DW_AT_data_member_location: 160
 <2><1ca>: Abbrev Number: 1 (DW_TAG_member)
    <1cb>   DW_AT_name        : (indirect string, offset: 0x2e9): _freeres_list
    <1cf>   DW_AT_decl_file   : 5
    <1cf>   DW_AT_decl_line   : 93
    <1d0>   DW_AT_decl_column : 20
    <1d1>   DW_AT_type        : <0x225>
    <1d5>   DW_AT_data_member_location: 168
 <2><1d6>: Abbrev Number: 1 (DW_TAG_member)
    <1d7>   DW_AT_name        : (indirect string, offset: 0x194): _freeres_buf
    <1db>   DW_AT_decl_file   : 5
    <1db>   DW_AT_decl_line   : 94
    <1dc>   DW_AT_decl_column : 9
    <1dd>   DW_AT_type        : <0x48>
    <1e1>   DW_AT_data_member_location: 176
 <2><1e2>: Abbrev Number: 1 (DW_TAG_member)
    <1e3>   DW_AT_name        : (indirect string, offset: 0x28f): __pad5
    <1e7>   DW_AT_decl_file   : 5
    <1e7>   DW_AT_decl_line   : 95
    <1e8>   DW_AT_decl_column : 10
    <1e9>   DW_AT_type        : <0x2e>
    <1ed>   DW_AT_data_member_location: 184
 <2><1ee>: Abbrev Number: 1 (DW_TAG_member)
    <1ef>   DW_AT_name        : (indirect string, offset: 0x1de): _mode
    <1f3>   DW_AT_decl_file   : 5
    <1f3>   DW_AT_decl_line   : 96
    <1f4>   DW_AT_decl_column : 7
    <1f5>   DW_AT_type        : <0x66>
    <1f9>   DW_AT_data_member_location: 192
 <2><1fa>: Abbrev Number: 1 (DW_TAG_member)
    <1fb>   DW_AT_name        : (indirect string, offset: 0x296): _unused2
    <1ff>   DW_AT_decl_file   : 5
    <1ff>   DW_AT_decl_line   : 98
    <200>   DW_AT_decl_column : 8
    <201>   DW_AT_type        : <0x253>
    <205>   DW_AT_data_member_location: 196
 <2><206>: Abbrev Number: 0
 <1><207>: Abbrev Number: 9 (DW_TAG_typedef)
    <208>   DW_AT_name        : (indirect string, offset: 0x210): FILE
    <20c>   DW_AT_decl_file   : 6
    <20d>   DW_AT_decl_line   : 7
    <20e>   DW_AT_decl_column : 25
    <20f>   DW_AT_type        : <0x9d>
 <1><213>: Abbrev Number: 25 (DW_TAG_typedef)
    <214>   DW_AT_name        : (indirect string, offset: 0x201): _IO_lock_t
    <218>   DW_AT_decl_file   : 5
    <219>   DW_AT_decl_line   : 43
    <21a>   DW_AT_decl_column : 14
 <1><21b>: Abbrev Number: 12 (DW_TAG_structure_type)
    <21c>   DW_AT_name        : (indirect string, offset: 0x183): _IO_marker
    <220>   DW_AT_declaration : 1
 <1><220>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <221>   DW_AT_byte_size   : 8
    <221>   DW_AT_type        : <0x21b>
 <1><225>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <226>   DW_AT_byte_size   : 8
    <226>   DW_AT_type        : <0x9d>
 <1><22a>: Abbrev Number: 13 (DW_TAG_array_type)
    <22b>   DW_AT_type        : <0x91>
    <22f>   DW_AT_sibling     : <0x23a>
 <2><233>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <234>   DW_AT_type        : <0x3a>
    <238>   DW_AT_upper_bound : 0
 <2><239>: Abbrev Number: 0
 <1><23a>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <23b>   DW_AT_byte_size   : 8
    <23b>   DW_AT_type        : <0x213>
 <1><23f>: Abbrev Number: 12 (DW_TAG_structure_type)
    <240>   DW_AT_name        : (indirect string, offset: 0x147): _IO_codecvt
    <244>   DW_AT_declaration : 1
 <1><244>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <245>   DW_AT_byte_size   : 8
    <245>   DW_AT_type        : <0x23f>
 <1><249>: Abbrev Number: 12 (DW_TAG_structure_type)
    <24a>   DW_AT_name        : (indirect string, offset: 0x23c): _IO_wide_data
    <24e>   DW_AT_declaration : 1
 <1><24e>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <24f>   DW_AT_byte_size   : 8
    <24f>   DW_AT_type        : <0x249>
 <1><253>: Abbrev Number: 13 (DW_TAG_array_type)
    <254>   DW_AT_type        : <0x91>
    <258>   DW_AT_sibling     : <0x263>
 <2><25c>: Abbrev Number: 14 (DW_TAG_subrange_type)
    <25d>   DW_AT_type        : <0x3a>
    <261>   DW_AT_upper_bound : 19
 <2><262>: Abbrev Number: 0
 <1><263>: Abbrev Number: 26 (DW_TAG_variable)
    <264>   DW_AT_name        : (indirect string, offset: 0x18e): stdin
    <268>   DW_AT_decl_file   : 7
    <269>   DW_AT_decl_line   : 143
    <26a>   DW_AT_decl_column : 14
    <26b>   DW_AT_type        : <0x26f>
    <26f>   DW_AT_external    : 1
    <26f>   DW_AT_declaration : 1
 <1><26f>: Abbrev Number: 5 (DW_TAG_pointer_type)
    <270>   DW_AT_byte_size   : 8
    <270>   DW_AT_type        : <0x207>
 <1><274>: Abbrev Number: 4 (DW_TAG_base_type)
    <275>   DW_AT_byte_size   : 8
    <276>   DW_AT_encoding    : 5	(signed)
    <277>   DW_AT_name        : (indirect string, offset: 0xf7): long long int
 <1><27b>: Abbrev Number: 4 (DW_TAG_base_type)
    <27c>   DW_AT_byte_size   : 8
    <27d>   DW_AT_encoding    : 7	(unsigned)
    <27e>   DW_AT_name        : (indirect string, offset: 0x41): long long unsigned int
 <1><282>: Abbrev Number: 27 (DW_TAG_variable)
    <283>   DW_AT_name        : (indirect string, offset: 0x16c): infile
    <287>   DW_AT_decl_file   : 1
    <288>   DW_AT_decl_line   : 34
    <289>   DW_AT_decl_column : 7
    <28a>   DW_AT_type        : <0x26f>
    <28e>   DW_AT_external    : 1
    <28e>   DW_AT_location    : 9 byte block: 3 90 56 0 0 0 0 0 0 	(DW_OP_addr: 5690)
 <1><298>: Abbrev Number: 28 (DW_TAG_subprogram)
    <299>   DW_AT_external    : 1
    <299>   DW_AT_name        : (indirect string, offset: 0x153): __printf_chk
    <29d>   DW_AT_decl_file   : 2
    <29e>   DW_AT_decl_line   : 95
    <29f>   DW_AT_decl_column : 12
    <2a0>   DW_AT_prototyped  : 1
    <2a0>   DW_AT_type        : <0x66>
    <2a4>   DW_AT_declaration : 1
    <2a4>   DW_AT_sibling     : <0x2b4>
 <2><2a8>: Abbrev Number: 3 (DW_TAG_formal_parameter)
    <2a9>   DW_AT_type        : <0x66>
